espressif/esp-idf/components/soc/esp32h4/register/soc/cpu_apm_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** CPU_APM_REGION_FILTER_EN_REG register
 *  Region filter enable register
 */
#define CPU_APM_REGION_FILTER_EN_REG (DR_REG_CPU_APM_BASE + 0x0)
/** CPU_APM_REGION_FILTER_EN : R/W; bitpos: [7:0]; default: 1;
 *  Configure bit $n (0-7) to enable region $n.
 *  0: disable
 *  1: enable
 */
#define CPU_APM_REGION_FILTER_EN    0x000000FFU
#define CPU_APM_REGION_FILTER_EN_M  (CPU_APM_REGION_FILTER_EN_V << CPU_APM_REGION_FILTER_EN_S)
#define CPU_APM_REGION_FILTER_EN_V  0x000000FFU
#define CPU_APM_REGION_FILTER_EN_S  0

/** CPU_APM_REGION0_ADDR_START_REG register
 *  Region address register
 */
#define CPU_APM_REGION0_ADDR_START_REG (DR_REG_CPU_APM_BASE + 0x4)
/** CPU_APM_REGION0_ADDR_START_L : HRO; bitpos: [12:0]; default: 0;
 *  Low 12 bit, start address of region 0.
 */
#define CPU_APM_REGION0_ADDR_START_L    0x00001FFFU
#define CPU_APM_REGION0_ADDR_START_L_M  (CPU_APM_REGION0_ADDR_START_L_V << CPU_APM_REGION0_ADDR_START_L_S)
#define CPU_APM_REGION0_ADDR_START_L_V  0x00001FFFU
#define CPU_APM_REGION0_ADDR_START_L_S  0
/** CPU_APM_REGION0_ADDR_START : R/W; bitpos: [24:13]; default: 0;
 *  Configures start address of region 0.
 */
#define CPU_APM_REGION0_ADDR_START    0x00000FFFU
#define CPU_APM_REGION0_ADDR_START_M  (CPU_APM_REGION0_ADDR_START_V << CPU_APM_REGION0_ADDR_START_S)
#define CPU_APM_REGION0_ADDR_START_V  0x00000FFFU
#define CPU_APM_REGION0_ADDR_START_S  13
/** CPU_APM_REGION0_ADDR_START_H : HRO; bitpos: [31:25]; default: 1;
 *  High 13 bit,  start address of region 0.
 */
#define CPU_APM_REGION0_ADDR_START_H    0x0000007FU
#define CPU_APM_REGION0_ADDR_START_H_M  (CPU_APM_REGION0_ADDR_START_H_V << CPU_APM_REGION0_ADDR_START_H_S)
#define CPU_APM_REGION0_ADDR_START_H_V  0x0000007FU
#define CPU_APM_REGION0_ADDR_START_H_S  25

/** CPU_APM_REGION0_ADDR_END_REG register
 *  Region address register
 */
#define CPU_APM_REGION0_ADDR_END_REG (DR_REG_CPU_APM_BASE + 0x8)
/** CPU_APM_REGION0_ADDR_END_L : HRO; bitpos: [12:0]; default: 8191;
 *  Low 12 bit, end address of region 0.
 */
#define CPU_APM_REGION0_ADDR_END_L    0x00001FFFU
#define CPU_APM_REGION0_ADDR_END_L_M  (CPU_APM_REGION0_ADDR_END_L_V << CPU_APM_REGION0_ADDR_END_L_S)
#define CPU_APM_REGION0_ADDR_END_L_V  0x00001FFFU
#define CPU_APM_REGION0_ADDR_END_L_S  0
/** CPU_APM_REGION0_ADDR_END : R/W; bitpos: [24:13]; default: 4095;
 *  Configures end address of region 0.
 */
#define CPU_APM_REGION0_ADDR_END    0x00000FFFU
#define CPU_APM_REGION0_ADDR_END_M  (CPU_APM_REGION0_ADDR_END_V << CPU_APM_REGION0_ADDR_END_S)
#define CPU_APM_REGION0_ADDR_END_V  0x00000FFFU
#define CPU_APM_REGION0_ADDR_END_S  13
/** CPU_APM_REGION0_ADDR_END_H : HRO; bitpos: [31:25]; default: 1;
 *  High 13 bit,  end address of region 0.
 */
#define CPU_APM_REGION0_ADDR_END_H    0x0000007FU
#define CPU_APM_REGION0_ADDR_END_H_M  (CPU_APM_REGION0_ADDR_END_H_V << CPU_APM_REGION0_ADDR_END_H_S)
#define CPU_APM_REGION0_ADDR_END_H_V  0x0000007FU
#define CPU_APM_REGION0_ADDR_END_H_S  25

/** CPU_APM_REGION0_ATTR_REG register
 *  Region access authority attribute register
 */
#define CPU_APM_REGION0_ATTR_REG (DR_REG_CPU_APM_BASE + 0xc)
/** CPU_APM_REGION0_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 0.
 */
#define CPU_APM_REGION0_R0_X    (BIT(0))
#define CPU_APM_REGION0_R0_X_M  (CPU_APM_REGION0_R0_X_V << CPU_APM_REGION0_R0_X_S)
#define CPU_APM_REGION0_R0_X_V  0x00000001U
#define CPU_APM_REGION0_R0_X_S  0
/** CPU_APM_REGION0_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 0.
 */
#define CPU_APM_REGION0_R0_W    (BIT(1))
#define CPU_APM_REGION0_R0_W_M  (CPU_APM_REGION0_R0_W_V << CPU_APM_REGION0_R0_W_S)
#define CPU_APM_REGION0_R0_W_V  0x00000001U
#define CPU_APM_REGION0_R0_W_S  1
/** CPU_APM_REGION0_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 0.
 */
#define CPU_APM_REGION0_R0_R    (BIT(2))
#define CPU_APM_REGION0_R0_R_M  (CPU_APM_REGION0_R0_R_V << CPU_APM_REGION0_R0_R_S)
#define CPU_APM_REGION0_R0_R_V  0x00000001U
#define CPU_APM_REGION0_R0_R_S  2
/** CPU_APM_REGION0_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 0.
 */
#define CPU_APM_REGION0_R1_X    (BIT(4))
#define CPU_APM_REGION0_R1_X_M  (CPU_APM_REGION0_R1_X_V << CPU_APM_REGION0_R1_X_S)
#define CPU_APM_REGION0_R1_X_V  0x00000001U
#define CPU_APM_REGION0_R1_X_S  4
/** CPU_APM_REGION0_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 0.
 */
#define CPU_APM_REGION0_R1_W    (BIT(5))
#define CPU_APM_REGION0_R1_W_M  (CPU_APM_REGION0_R1_W_V << CPU_APM_REGION0_R1_W_S)
#define CPU_APM_REGION0_R1_W_V  0x00000001U
#define CPU_APM_REGION0_R1_W_S  5
/** CPU_APM_REGION0_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 0.
 */
#define CPU_APM_REGION0_R1_R    (BIT(6))
#define CPU_APM_REGION0_R1_R_M  (CPU_APM_REGION0_R1_R_V << CPU_APM_REGION0_R1_R_S)
#define CPU_APM_REGION0_R1_R_V  0x00000001U
#define CPU_APM_REGION0_R1_R_S  6
/** CPU_APM_REGION0_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 0.
 */
#define CPU_APM_REGION0_R2_X    (BIT(8))
#define CPU_APM_REGION0_R2_X_M  (CPU_APM_REGION0_R2_X_V << CPU_APM_REGION0_R2_X_S)
#define CPU_APM_REGION0_R2_X_V  0x00000001U
#define CPU_APM_REGION0_R2_X_S  8
/** CPU_APM_REGION0_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 0.
 */
#define CPU_APM_REGION0_R2_W    (BIT(9))
#define CPU_APM_REGION0_R2_W_M  (CPU_APM_REGION0_R2_W_V << CPU_APM_REGION0_R2_W_S)
#define CPU_APM_REGION0_R2_W_V  0x00000001U
#define CPU_APM_REGION0_R2_W_S  9
/** CPU_APM_REGION0_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 0.
 */
#define CPU_APM_REGION0_R2_R    (BIT(10))
#define CPU_APM_REGION0_R2_R_M  (CPU_APM_REGION0_R2_R_V << CPU_APM_REGION0_R2_R_S)
#define CPU_APM_REGION0_R2_R_V  0x00000001U
#define CPU_APM_REGION0_R2_R_S  10
/** CPU_APM_REGION0_LOCK : R/W; bitpos: [11]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define CPU_APM_REGION0_LOCK    (BIT(11))
#define CPU_APM_REGION0_LOCK_M  (CPU_APM_REGION0_LOCK_V << CPU_APM_REGION0_LOCK_S)
#define CPU_APM_REGION0_LOCK_V  0x00000001U
#define CPU_APM_REGION0_LOCK_S  11

