espressif/esp-idf/components/soc/esp32h4/register/soc/cpu_apm_reg.h
/** CPU_APM_INT_EN_REG register
 *  APM interrupt enable register
 */
#define CPU_APM_INT_EN_REG (DR_REG_CPU_APM_BASE + 0x118)
/** CPU_APM_M0_APM_INT_EN : R/W; bitpos: [0]; default: 0;
 *  Configures to enable APM M0 interrupt.
 *  0: disable
 *  1: enable
 */
#define CPU_APM_M0_APM_INT_EN    (BIT(0))
#define CPU_APM_M0_APM_INT_EN_M  (CPU_APM_M0_APM_INT_EN_V << CPU_APM_M0_APM_INT_EN_S)
#define CPU_APM_M0_APM_INT_EN_V  0x00000001U
#define CPU_APM_M0_APM_INT_EN_S  0
/** CPU_APM_M1_APM_INT_EN : R/W; bitpos: [1]; default: 0;
 *  Configures to enable APM M1 interrupt.
 *  0: disable
 *  1: enable
 */
#define CPU_APM_M1_APM_INT_EN    (BIT(1))
#define CPU_APM_M1_APM_INT_EN_M  (CPU_APM_M1_APM_INT_EN_V << CPU_APM_M1_APM_INT_EN_S)
#define CPU_APM_M1_APM_INT_EN_V  0x00000001U
#define CPU_APM_M1_APM_INT_EN_S  1
/** CPU_APM_M2_APM_INT_EN : R/W; bitpos: [2]; default: 0;
 *  Configures to enable APM M2 interrupt.
 *  0: disable
 *  1: enable
 */
#define CPU_APM_M2_APM_INT_EN    (BIT(2))
#define CPU_APM_M2_APM_INT_EN_M  (CPU_APM_M2_APM_INT_EN_V << CPU_APM_M2_APM_INT_EN_S)
#define CPU_APM_M2_APM_INT_EN_V  0x00000001U
#define CPU_APM_M2_APM_INT_EN_S  2
/** CPU_APM_M3_APM_INT_EN : R/W; bitpos: [3]; default: 0;
 *  Configures to enable APM M3 interrupt.
 *  0: disable
 *  1: enable
 */
#define CPU_APM_M3_APM_INT_EN    (BIT(3))
#define CPU_APM_M3_APM_INT_EN_M  (CPU_APM_M3_APM_INT_EN_V << CPU_APM_M3_APM_INT_EN_S)
#define CPU_APM_M3_APM_INT_EN_V  0x00000001U
#define CPU_APM_M3_APM_INT_EN_S  3

/** CPU_APM_CLOCK_GATE_REG register
 *  Clock gating register
 */
#define CPU_APM_CLOCK_GATE_REG (DR_REG_CPU_APM_BASE + 0x7f8)
/** CPU_APM_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether to keep the clock always on.
 *  0: enable automatic clock gating
 *  1: keep the clock always on
 */
#define CPU_APM_CLK_EN    (BIT(0))
#define CPU_APM_CLK_EN_M  (CPU_APM_CLK_EN_V << CPU_APM_CLK_EN_S)
#define CPU_APM_CLK_EN_V  0x00000001U
#define CPU_APM_CLK_EN_S  0

/** CPU_APM_DATE_REG register
 *  Version control register
 */
#define CPU_APM_DATE_REG (DR_REG_CPU_APM_BASE + 0x7fc)
/** CPU_APM_DATE : R/W; bitpos: [27:0]; default: 38814240;
 *  Version control register.
 */
#define CPU_APM_DATE    0x0FFFFFFFU
#define CPU_APM_DATE_M  (CPU_APM_DATE_V << CPU_APM_DATE_S)
#define CPU_APM_DATE_V  0x0FFFFFFFU
#define CPU_APM_DATE_S  0

#ifdef __cplusplus
}
#endif
